// Задача 48: Задайте двумерный массив размера m на n,
// каждый элемент в массиве находится по формуле: Amn = m+n.
// Выведите полученный массив на экран.
// m = 3, n = 4.
// 0 1 2 3
// 1 2 3 4
// 2 3 4 5

int[,] arr1 = CreatMatrixNM(3, 4, 1, 50);
PrintMatrix(arr1);


// Создание двумерного массива значениями от сложения индексов позиций
int[,] CreatMatrixNM(int rows, int columns, int min, int max)
{
	int[,] matrix = new int[rows, columns];
	for (int i = 0; i < matrix.GetLength(0); i++)
	{
		for (int j = 0; j < matrix.GetLength(1); j++)
		{
			matrix[i, j] = i + j;
		}
	}
	return matrix;
}

// Печать двумерного массива
void PrintMatrix(int[,] matrix)
{
	for (int i = 0; i < matrix.GetLength(0); i++)
	{
		Console.Write("[");
		for (int j = 0; j < matrix.GetLength(1); j++)
		{
			if (j < matrix.GetLength(1) - 1) Console.Write(matrix[i, j] + ",");
			else Console.Write(matrix[i, j]);
		}
		Console.WriteLine("]");
	}
}