// Задача 25: Напишите цикл,
//  который принимает на вход два числа (A и B)
//  возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

System.Console.WriteLine("Введите число:");
int numberA = Convert.ToInt32(Console.ReadLine());

